БухЭксп/InformationRegisters/CW_УслугиПоДоговоруГрузоперевозки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_УслугиПоДоговоруГрузоперевозки</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УслугиПоДоговруГрузоперевозки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_УслугиПоДоговоруГрузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиГрузоперевозок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиЗаказов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ДействияДляТиповКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ДействияДляТиповКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаписатьПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НайтиАдрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткрытьСсылку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомандаСистемы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Documents/CW_УслугиПоДоговоруГрузоперевозки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_УслугиПоДоговоруГрузоперевозки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.CW_УслугиПоДоговоруГрузоперевозки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НоменклатураПоДоговору</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Груз</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокОтражения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияДоходов</v8:Type>
								<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантРасчетаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыРасчетаНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/Catalogs/CW_ОбъектыАрхива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ОбъектыАрхива</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_ВладельцыАрхива</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла без расширения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Том</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТомаАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗахвачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийРедактор</Name>
					<Comment>Пользователь захвативший файл</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗагружен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыДокументовФайловогоАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеПараметров</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВОблаке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектАрхиваВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОбъектыАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособХраненияАрхива</Name>
					<Comment>0 - прикреплен,1 - в облаке; 2 - ссылка на ранее прикрепленный</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/_УФС/Ext/Module.bsl
&НаСервере
Процедура НастройкаФормыСтандартногоСправочника(Форма) Экспорт 
	
	// --- 
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьИсториюВыбораДляЭлемента(ЭлементФормы) Экспорт 
	// --- 
		
	ЭлементФормы.ИсторияВыбораПриВводе=ИсторияВыбораПриВводе.НеИспользовать;
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура ВключитьКлассическийВидЭлементаФормы(ЭлементФормы) Экспорт
	// --- 
	
	//Если (ЭлементФормы.КнопкаВыбора <> Ложь) Тогда
	//	
	//	//ЭлементФормы.КнопкаВыбора = Истина;
	//	ЭлементФормы.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;	
	//	
	//КонецЕсли; 
	//Если (ЭлементФормы.КнопкаВыпадающегоСписка <> Истина) Тогда
	//	
	//	ЭлементФормы.КнопкаВыпадающегоСписка = Ложь;	
	//	
	//КонецЕсли; 
	//ЭлементФормы.КнопкаСоздания = Ложь;
	//
	// --- 
КонецПроцедуры
 

&НаСервере
Процедура ОтключитьИсториюВыбораЭлементовФормы(Форма, МассивИсключаемыхРеквизитов=Неопределено) Экспорт 
	// --- 
	
	Если (МассивИсключаемыхРеквизитов = Неопределено) Тогда
		
		МассивИсключаемыхРеквизитов = Новый Массив;
		
	КонецЕсли; 
	ЕстьИсключаемые = (МассивИсключаемыхРеквизитов.Количество() <> 0);
	
	Для каждого ЭлементФормы Из Форма.Элементы Цикл
		
		Если (ТипЗнч(ЭлементФормы) = Тип("ПолеФормы")) Тогда
			
			Если (ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода) Тогда
				
				ОтключитьИсторию = Истина;
				Если (ЕстьИсключаемые) Тогда
					
					Если (МассивИсключаемыхРеквизитов.Найти(ЭлементФормы.ПутьКДанным) <> Неопределено) Тогда
						
						ОтключитьИсторию = Ложь;
						
					КонецЕсли; 
					
				КонецЕсли; 
				Если (ОтключитьИсторию) Тогда
					
					ОтключитьИсториюВыбораДляЭлемента(ЭлементФормы);
					
				КонецЕсли;
				ВключитьКлассическийВидЭлементаФормы(ЭлементФормы);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры
 

// ---------------------------------------------------------------------------- 

// ПРОЦЕДУРЫ ОТБОРОВ И УСЛОВНОГО ОФОРМЛЕНИЯ

&НаСервере
Функция ДобавитьОтбор(Отбор,ИмяПоля,ВидСравнения=Неопределено,Значение) Экспорт 
	
	ОДС = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОДС.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ОДС.ВидСравнения = ?(ВидСравнения=Неопределено,ВидСравненияКомпоновкиДанных.Равно,ВидСравнения);
	ОДС.ПравоеЗначение = Значение;
	ОДС.Использование = Истина;
	
	Возврат(ОДС);
	
КонецФункции

&НаСервере
Процедура СкопироватьОтбор(Источник,Получатель, Очищать=Истина) Экспорт 
	
	Если Очищать Тогда
		Получатель.Элементы.Очистить();   
	КонецЕсли;
	
	Для каждого ЭлементОтбора Из Источник.Элементы Цикл
		
		Если ТипЗнч(ЭлементОтбора)=Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			
			// создаем группу в получателе и уходим в рекурсию
			
			НГО = Получатель.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(НГО,ЭлементОтбора);
			
			СкопироватьОтбор(ЭлементОтбора,НГО, Очищать);
			
		КонецЕсли; 
		// --- 
		Если ТипЗнч(ЭлементОтбора)=Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			// создаем элемент и заполняем
			НЭО = Получатель.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));			
			ЗаполнитьЗначенияСвойств(НЭО,ЭлементОтбора);
			
		КонецЕсли;  
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьПорядок(Источник,Получатель) Экспорт 
	// --- 
	
	Получатель.Элементы.Очистить();
	
	Для каждого ЭлементПорядка Из Источник.Элементы Цикл
		
		Если ТипЗнч(ЭлементПорядка)=Тип("ЭлементПорядкаКомпоновкиДанных") Тогда
			
			НЭП = Получатель.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(НЭП,ЭлементПорядка);
			
		КонецЕсли;  
		// --- 		
		Если ТипЗнч(ЭлементПорядка)=Тип("АвтоЭлементПорядкаКомпоновкиДанных") Тогда
			
			НЭП = Получатель.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(НЭП,ЭлементПорядка);
			
		КонецЕсли;  

		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура СкопироватьГруппировку(Источник,Получатель) Экспорт 
	// --- 
	
	Получатель.Элементы.Очистить();
	
	Для каждого эл Из Источник.Элементы Цикл
		
		Если ТипЗнч(эл)=Тип("ПолеГруппировкиКомпоновкиДанных") Тогда
			
			НЭП = Получатель.Элементы.Добавить(ТипЗнч(эл));
			ЗаполнитьЗначенияСвойств(НЭП,эл);
			
		КонецЕсли;  
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры

// --- 

Функция ПолучитьДанныеДинамическогоСписка(ДинСписок, СтрокаПолей) Экспорт

    СКД = Новый СхемаКомпоновкиДанных;
    Источник = СКД.ИсточникиДанных.Добавить();
    Источник.Имя = "ЛокальнаяБаза";
    Источник.СтрокаСоединения     = "";
    Источник.ТипИсточникаДанных = "Local";
    
    // скопируем текст запроса из динамического списка

    НаборДанных = СКД.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
    НаборДанных.Имя = "Основной";
    НаборДанных.ИсточникДанных = "ЛокальнаяБаза";
    НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
    НаборДанных.Запрос = ДинСписок.ТекстЗапроса;
    ТекстЗапроса = ДинСписок.ТекстЗапроса;
    СКД.НаборыДанных.Основной.Запрос = ТекстЗапроса;
    
    // добавляем поля

    МассивПолей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаПолей);
    Для каждого Поле Из МассивПолей Цикл
        ПолеСКД = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
        ПолеСКД.Заголовок     = Поле;
        ПолеСКД.ПутьКДанным = Поле;
        ПолеСКД.Поле         = Поле;
    КонецЦикла;
    
     НастройкиКомпоновкиДанных     = СКД.НастройкиПоУмолчанию;
    //добавим поля в группировку детальных записей

    ГруппировкаДетальная        = НастройкиКомпоновкиДанных.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
    Для каждого Поле Из МассивПолей Цикл
        ВыбранноеПоле = ГруппировкаДетальная.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
        ВыбранноеПоле.Заголовок     = Поле;
        ВыбранноеПоле.Использование = Истина;
        ВыбранноеПоле.Поле            = Новый ПолеКомпоновкиДанных(Поле);
    КонецЦикла; 
    
    // подготовим таблицу и процессор вывода результата СКД в таблицу значений

    Таб = Новый ТаблицаЗначений;    
    ПроцессорВыводаВТЗ = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;    
    ПроцессорВыводаВТЗ.УстановитьОбъект(Таб);    
    
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
    КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
    
    // загрузим настройки из настроек динамического списка

    Для Каждого ЭлементОтбораДС Из ДинСписок.Отбор.Элементы Цикл
        ЭлементОтбораСКД = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        ЗаполнитьЗначенияСвойств(ЭлементОтбораСКД, ЭлементОтбораДС);
    КонецЦикла;    
    
    Для Каждого ЗначениеПараметраДС Из ДинСписок.Параметры.Элементы Цикл
        ЗначениеПараметраСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Добавить();
        ЗаполнитьЗначенияСвойств(ЗначениеПараметраСКД, ЗначениеПараметраДС);
    КонецЦикла;
    
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД,КомпоновщикНастроек.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;    
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
    
    Таб = ПроцессорВыводаВТЗ.Вывести(ПроцессорКомпоновкиДанных);    
    
    Возврат Таб;

КонецФункции// ПолучитьДанныеДинСписка()

// --- 

&НаСервере
	Функция ДобавитьПростоеУсловноеОформление(Элемент, ПолеОтбора, ВидСравненияОтбора=Неопределено, Значение, ОформляемоеПоле, ИмяПараметра, ЗначениеПараметра=Неопределено) Экспорт 
	
	ЭлементУО = Элемент.УсловноеОформление.Элементы.Добавить();
	// --- 
	ОтборУО = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборУО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПолеОтбора);
	ОтборУО.ВидСравнения = ?(ВидСравненияОтбора=Неопределено,ВидСравненияКомпоновкиДанных.Равно,ВидСравненияОтбора);
	ОтборУО.ПравоеЗначение = Значение;
	ОтборУО.Использование = Истина;
	// --- 
	Если ЗначениеЗаполнено(ОформляемоеПоле) Тогда 
		ПолеУО = ЭлементУО.Поля.Элементы.Добавить();
		ПолеУО.Поле = Новый ПолеКомпоновкиДанных(ОформляемоеПоле);
		ПолеУО.Использование = Истина;
	КонецЕсли;
	// --- 
	Если ТипЗнч(ИмяПараметра)=Тип("Строка") Тогда
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра(ИмяПараметра, ЗначениеПараметра);
		
	ИначеЕсли ТипЗнч(ИмяПараметра)=Тип("Структура") Тогда
		
		//ИмяПараметра = Новый Структура;
		Для каждого КлючЗначение Из ИмяПараметра Цикл
			
			ЭлементУО.Оформление.УстановитьЗначениеПараметра(КлючЗначение.Ключ, КлючЗначение.Значение);
			
		КонецЦикла; 
		
	КонецЕсли;
	
	// --- 
	ЭлементУО.Использование = Истина;
	
	Возврат(ЭлементУО);
	
КонецФункции

// ---------------------------------------------------------------------------- 

// ПРОЦЕДУРЫ СПИСКОВ

&НаСервере
Процедура СоздатьОбвязкуДинамическогоСписка(Форма, ИмяДС, ИмяТаблицыДС) Экспорт 
	// --- 
	
	// инициализируем список и создаём реквизиты формы
	
	// входящий параметр "имя", например "Коносаменты"
	// входящий параметр "таблица", например "Справочник.ОкеанскиеКоносаменты" 
	
	//ИмяДС = "Коносаменты";
	//ИмяТаблицыДС = "Справочник.ОкеанскиеКоносаменты";
		
	// реквизит "_Настройка"
	_Настройка_Коносаменты = Новый Структура;
	_Настройка_Коносаменты.Вставить("ИмяСписка",ИмяДС);
	_Настройка_Коносаменты.Вставить("ИмяТаблицы",ИмяТаблицыДС);
	_Настройка_Коносаменты.Вставить("НастройкаКолонок",_Настройка_Коносаменты.ИмяСписка+"_НастройкаКолонок");
	_Настройка_Коносаменты.Вставить("КолонкиСписка",_Настройка_Коносаменты.ИмяСписка+"_КолонкиСписка");
	_Настройка_Коносаменты.Вставить("СтекОтборов",_Настройка_Коносаменты.ИмяСписка+"_СтекОтборов");
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	// --- 
	// реквизит "_Настройка"
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяДС+"_Настройка",Новый ОписаниеТипов("Строка")));
	
	// --- 
	// реквизит "_НастройкаКолонок" - настройка

	ИмяРеквизита = ИмяДС+"_НастройкаКолонок";
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизита,Новый ОписаниеТипов("ТаблицаЗначений")));
	// колонки
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Имя",Новый ОписаниеТипов("Строка"),ИмяРеквизита));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Заголовок",Новый ОписаниеТипов("Строка"),ИмяРеквизита));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Тип",Новый ОписаниеТипов("Строка"),ИмяРеквизита));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ПрямоеРедактирование",Новый ОписаниеТипов("Булево"),ИмяРеквизита));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ГоризонтальноеПоложение",Новый ОписаниеТипов("Строка"),ИмяРеквизита));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Видимость",Новый ОписаниеТипов("Булево"),ИмяРеквизита));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Ширина",Новый ОписаниеТипов("Число"),ИмяРеквизита));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ОтображатьЗаголовок",Новый ОписаниеТипов("Булево"),ИмяРеквизита));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Шрифт",Новый ОписаниеТипов("Строка"),ИмяРеквизита));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ЦветТекста",Новый ОписаниеТипов("Строка"),ИмяРеквизита));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ЦветФона",Новый ОписаниеТипов("Строка"),ИмяРеквизита));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ФиксацияВТаблице",Новый ОписаниеТипов("Строка"),ИмяРеквизита));
	
	// --- 
	// реквизит "_КолонкиСписка" - текущие колонки
    МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяДС+"_КолонкиСписка",Новый ОписаниеТипов("СписокЗначений")));
	
	// --- 
	// реквизит "_СтекОтборов"
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяДС+"_СтекОтборов",Новый ОписаниеТипов("ТаблицаЗначений")));
	// колонки
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Имя",Новый ОписаниеТипов("Строка"),ИмяДС+"_СтекОтборов"));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Идентификатор",Новый ОписаниеТипов("Строка"),ИмяДС+"_СтекОтборов"));
	
	// --- 
	// реквизит "РежимРедактированияСписка"
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяДС+"_РежимРедактированияСписка",Новый ОписаниеТипов("Булево")));	
	// реквизит "РежимОтображенияАрхивных"
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяДС+"_РежимОтображенияАрхивных",Новый ОписаниеТипов("Булево")));	
	
	// --- 
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
	// ----------------------------------------------------------------------------  
	// заполняем
	
	Форма[ИмяДС+"_Настройка"] = ПоместитьВоВременноеХранилище(_Настройка_Коносаменты,Форма.УникальныйИдентификатор);
	
	// --- 
КонецПроцедуры

&НаСервере
Функция ДобавитьЭлементНастройкиСписка(Список,ПараметрыСписка,Имя,Заголовок=Неопределено,Тип,Видимость=Истина,ПрямоеРедактирование=Ложь,СтруктураПараметров) Экспорт 
	
	// --- 
		
	Нстр = Список.Добавить();
	Нстр.Имя = Имя;
	
	Если Заголовок = Неопределено Тогда
		
		// имя таблицы
		ИмяТаблицы = ПараметрыСписка.ИмяТаблицы;
		ТипТаблицы = _сф.стр_ПолучитьСтроку(ИмяТаблицы,".",1);
		Таблица = _сф.стр_ПолучитьСтроку(ИмяТаблицы,".",2);
		
		Если ТипТаблицы = "Справочник" Тогда
			
			Если Имя = "Наименование" ИЛИ Имя = "Код" Тогда
				
				Синоним = Метаданные.Справочники[Таблица].СтандартныеРеквизиты[Имя].Синоним;
				Нстр.Заголовок = ?(СокрЛП(Синоним)="",Имя,Синоним);
				
			Иначе
				
				Нстр.Заголовок = Метаданные.Справочники[Таблица].Реквизиты[Имя].Синоним;
				
			КонецЕсли; 
			
		ИначеЕсли ТипТаблицы = "Документ" Тогда
			
			Нстр.Заголовок = Метаданные.Документы[Таблица].Реквизиты[Имя].Синоним;
			
		Иначе
			
			Нстр.Заголовок = Заголовок;
			
		КонецЕсли; 
				
	Иначе
		
		Нстр.Заголовок = Заголовок;
		
	КонецЕсли; 
	
	Нстр.Тип = Тип;
	Нстр.Видимость = Видимость;
	Нстр.ПрямоеРедактирование = ПрямоеРедактирование;
	// --- 
	Нстр.ГоризонтальноеПоложение = СтруктураПараметров.ГоризонтальноеПоложение;
	Нстр.Ширина = СтруктураПараметров.Ширина;
	Нстр.ОтображатьЗаголовок = СтруктураПараметров.ОтображатьЗаголовок;
	Нстр.Шрифт = СтруктураПараметров.Шрифт;
	Нстр.ЦветТекста = СтруктураПараметров.ЦветТекста;
	Нстр.ЦветТекста = СтруктураПараметров.ЦветТекста;
	
	Возврат(Нстр);
	
КонецФункции

&НаСервере
Функция ПСПК(Ширина=0,ОтображатьЗаголовок=Истина,ГоризонтальноеПоложениеТекста=Неопределено,Шрифт=Неопределено,ЦветТекста=Неопределено,ЦветФона=Неопределено) Экспорт 
	
	Если ГоризонтальноеПоложениеТекста=Неопределено Тогда
		
		ГоризонтальноеПоложениеТекста = ГоризонтальноеПоложениеЭлемента.Центр;
		
	КонецЕсли; 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ширина",Ширина);
	СтруктураПараметров.Вставить("ОтображатьЗаголовок",ОтображатьЗаголовок);
	СтруктураПараметров.Вставить("ГоризонтальноеПоложение",ГоризонтальноеПоложениеТекста);
	СтруктураПараметров.Вставить("Шрифт",Шрифт);
	СтруктураПараметров.Вставить("ЦветТекста",ЦветТекста);
	СтруктураПараметров.Вставить("ЦветФона",ЦветФона);
	
	Возврат(СтруктураПараметров);
	
КонецФункции

// ---------------------------------------------------------------------------- 

// функция возвращает стандартную структуру ответа
&НаСервере
Функция Ответ(Код=0,ОписаниеОшибки="") Экспорт 
	// --- 
	
	СтруктураОтвета = _сф.ст_Создать("Код,ОписаниеОшибки");
	СтруктураОтвета.Код=0;
	СтруктураОтвета.ОписаниеОшибки="";
	Возврат(СтруктураОтвета);	
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаСервере
Функция ПроверитьНастрокуКолонок(ИмяСписка,Знач Настройка,Знач СтандартнаяНастройка) Экспорт 
	// --- 
	
	// удаляем несуществующие колонки колонки, проверяем параметры существующих
	// в стандартных помечаем задействованные, оставшиеся незадействованными добавляем невидимыми
	
	МассивКолонокКУдалению = Новый Массив;
	СтандартнаяНастройка.Колонки.Добавить("_Актив");
	СтандартнаяНастройка.ЗаполнитьЗначения(Ложь,"_Актив");
	// --- 
	
	Для каждого СтрокаНастройки Из Настройка Цикл
		
		//  пробуем найти
		СтрокаСтандартнойНастройки = СтандартнаяНастройка.Найти(СтрокаНастройки.Имя,"Имя");
		Если СтрокаСтандартнойНастройки = Неопределено Тогда
			
			МассивКолонокКУдалению.Добавить(СтрокаНастройки);
			
		Иначе
			
			// переносим заголовок и тип
			_сф.Заполнить(СтрокаНастройки,СтрокаСтандартнойНастройки,"Заголовок,Тип");
			
			// помечаем строку стандартной настройки
			СтрокаСтандартнойНастройки._Актив = Истина;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// удаляем устаревшие
	Для каждого СтрокаНастройки Из МассивКолонокКУдалению Цикл
		
		Настройка.Удалить(СтрокаНастройки);
		
	КонецЦикла; 
	
	// добавляем новые
	МассивДобавляемыхКолонок = СтандартнаяНастройка.НайтиСтроки(Новый Структура("_Актив",Ложь));
	Для каждого СтрокаСтандартнойНастройки Из МассивДобавляемыхКолонок Цикл
		
		Нстр = Настройка.Добавить();
		_сф.Заполнить(Нстр,СтрокаСтандартнойНастройки,,"Видимость");
		
	КонецЦикла; 
	
	Возврат(Настройка);
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаСервере
Функция СохранитьСеансовыеНастройки(Форма, ИмяНастройки="Сеансовая",Данные) Экспорт 
	
	Попытка
		
		ХранилищеСистемныхНастроек.Сохранить(Форма.ИмяФормы, ИмяНастройки, Данные);
		Возврат(_УФКС.Ответ());
		
	Исключение
	    
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
		
	КонецПопытки; 
	
	
КонецФункции

&НаСервере
Функция ЗагрузитьСеансовыеНастройки(Форма, ИмяНастройки="Сеансовая") Экспорт 
	
	Попытка
		Возврат(ХранилищеСистемныхНастроек.Загрузить(Форма.ИмяФормы, ИмяНастройки));
	Исключение
		Возврат(Неопределено);
	КонецПопытки; 

КонецФункции

// ---------------------------------------------------------------------------- 

&НаСервере
Функция КаталогУслуг() Экспорт 
	
	ПустаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
	КУ = Константы.CW_КаталогУслуг.Получить();
	Если (НЕ ЗначениеЗаполнено(КУ)) Тогда
		Возврат(ПустаяНоменклатура);
	КонецЕсли; 
	// --- 
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Номенклатура.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Родитель = &Родитель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка";
	// --- 
	Возврат(_сф.ВыполнитьЗапрос(ТекстЗапроса, Новый Структура("Родитель", КУ),Истина,"Ссылка", ПустаяНоменклатура));
	
КонецФункции

&НаСервере
Функция КаталогКлиентов() Экспорт 
	
	КК = Константы.CW_КаталогКлиентов.Получить();
	Возврат(ЭлементКаталога(КК));
	
КонецФункции

&НаСервере
Функция КаталогПоставщиков() Экспорт 
	
	КК = Константы.CW_КаталогПоставщиков.Получить();
	Возврат(ЭлементКаталога(КК));
	
КонецФункции

&НаСервере
Функция ЭлементКаталога(Родитель)
	// --- 
	
	Если (НЕ ЗначениеЗаполнено(Родитель)) Тогда
		Возврат(Справочники.Контрагенты.ПустаяСсылка());
	КонецЕсли; 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	Контрагенты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Родитель = &Родитель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка";
	Запрос.УстановитьПараметр("Родитель", Родитель);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если (ТЗ.Количество() = 1) Тогда
		Возврат(ТЗ[0].Ссылка);
	Иначе
		Возврат(Справочники.Контрагенты.ПустаяСсылка());
	КонецЕсли; 
	
	// --- 
КонецФункции
 
// ---------------------------------------------------------------------------- 

&НаСервере
Функция ПараметрыОткрытияКонтактнойИнформации(КИ) Экспорт 
	// --- 
	
	ТипКИ = КИ.ВидКИ.ТипКИ;
	ДействиеКИ = ТипКИ.Действие;
	
	Если (ДействиеКИ = Перечисления.CW_ДействияДляТиповКонтактнойИнформации.Нет) Тогда
		
		Возврат(Новый Структура("Действие,ТекстСообщения","ПоказатьПредупреждение","Действие для типа контактной информации не назначено."));
		
	ИначеЕсли (ДействиеКИ = Перечисления.CW_ДействияДляТиповКонтактнойИнформации.НаписатьПисьмо) Тогда 
		
		Возврат(Новый Структура("Действие,СтрокаКоманды","ЗапуститьПриложение","mailto:"+КИ.Наименование));
		
	ИначеЕсли (ДействиеКИ = Перечисления.CW_ДействияДляТиповКонтактнойИнформации.НайтиАдрес) Тогда 
		
		Возврат(Новый Структура("Действие,СтрокаКоманды","ЗапуститьПриложение","http://maps.google.com/maps?q="+СокрЛП(КИ.Наименование)));
		
	ИначеЕсли (ДействиеКИ = Перечисления.CW_ДействияДляТиповКонтактнойИнформации.ОткрытьСсылку) Тогда 
		
		Возврат(Новый Структура("Действие,СтрокаКоманды","ЗапуститьПриложение",КИ.Наименование));
		
	ИначеЕсли (ДействиеКИ = Перечисления.CW_ДействияДляТиповКонтактнойИнформации.КомандаСистемы) Тогда 
		
		Если (Найти(ТипКИ.КомандаДействия,"callto") <> 0) Тогда
			
			Значение = СокрЛП(КИ.Наименование);
			Значение = СтрЗаменить(Значение,"(","");
			Значение = СтрЗаменить(Значение,")","");
			Значение = СтрЗаменить(Значение,"-","");
			Значение = СтрЗаменить(Значение," ","");
			Значение = СтрЗаменить(Значение,"<","");
			Значение = СтрЗаменить(Значение,">","");
			Значение = СтрЗаменить(Значение,"/","");
			Значение = СтрЗаменить(Значение,"\","");
			Возврат(Новый Структура("Действие,СтрокаКоманды","ЗапуститьПриложение",ТипКИ.КомандаДействия+Значение));	
			
		Иначе
			
			Возврат(Новый Структура("Действие,СтрокаКоманды","ЗапуститьПриложение",ТипКИ.КомандаДействия+СокрЛП(КИ.Наименование)));	
			
		КонецЕсли; 
		
		
		
	ИначеЕсли (ДействиеКИ = Перечисления.CW_ДействияДляТиповКонтактнойИнформации.Обработчик) Тогда 
		
		// ...
		
	КонецЕсли; 
	
	// --- 
КонецФункции
 

//Процедуры огрангичения списка номенклатуры по договору
&НаСервере
Функция ОбновитьСписокУслугПоДоговору(ДатаСреза, Договор, Форма=Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаСреза) Тогда
		ДатаСреза = ТекущаяДата();
	Конецесли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	CW_УслугиПоДоговоруГрузоперевозкиСрезПоследних.Договор КАК Договор,
	               |	CW_УслугиПоДоговоруГрузоперевозкиСрезПоследних.УслугиПоДоговруГрузоперевозки КАК УслугиПоДоговруГрузоперевозки
	               |ПОМЕСТИТЬ ВТ_ТекущийДокумент
	               |ИЗ
	               |	РегистрСведений.CW_УслугиПоДоговоруГрузоперевозки.СрезПоследних(&ДатаСреза, Договор = &Договор) КАК CW_УслугиПоДоговоруГрузоперевозкиСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_УслугиПоДоговоруГрузоперевозкиНоменклатураПоДоговору.Номенклатура КАК Номенклатура,
	               |	CW_УслугиПоДоговоруГрузоперевозкиНоменклатураПоДоговору.Груз КАК Груз,
	               |	CW_УслугиПоДоговоруГрузоперевозкиНоменклатураПоДоговору.Клиент КАК Клиент,
	               |	CW_УслугиПоДоговоруГрузоперевозкиНоменклатураПоДоговору.ПорядокОтражения КАК ПорядокОтражения,
	               |	CW_УслугиПоДоговоруГрузоперевозкиНоменклатураПоДоговору.СтавкаНДС КАК СтавкаНДС,
	               |	CW_УслугиПоДоговоруГрузоперевозкиНоменклатураПоДоговору.ВариантРасчетаНДС КАК ВариантРасчетаНДС,
	               |	CW_УслугиПоДоговоруГрузоперевозкиНоменклатураПоДоговору.Цена КАК Цена,
	               |	CW_УслугиПоДоговоруГрузоперевозкиНоменклатураПоДоговору.ЦенаБезНДС КАК ЦенаБезНДС,
	               |	CW_УслугиПоДоговоруГрузоперевозкиНоменклатураПоДоговору.Валюта КАК Валюта
	               |ИЗ
	               |	Документ.CW_УслугиПоДоговоруГрузоперевозки.НоменклатураПоДоговору КАК CW_УслугиПоДоговоруГрузоперевозкиНоменклатураПоДоговору
	               |ГДЕ
	               |	CW_УслугиПоДоговоруГрузоперевозкиНоменклатураПоДоговору.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ВТ_ТекущийДокумент.УслугиПоДоговруГрузоперевозки КАК УслугиПоДоговруГрузоперевозки
	               |			ИЗ
	               |				ВТ_ТекущийДокумент КАК ВТ_ТекущийДокумент)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДатаСреза"	, ДатаСреза);
	Запрос.УстановитьПараметр("Договор"		, Договор);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;      
	
	ВалютаДоговора 		= Договор.ВалютаДоговора;
	КурсВалютыДоговра 	= CW_Финансы.ПолучитьКурсВалюты(ВалютаДоговора, ДатаСреза);
	
	кэшКурсов = Новый Соответствие;
	
	ТаблицаУслуг = РезультатЗапроса.Выгрузить();
	Для Каждого СтрокаТаблицы из ТаблицаУслуг Цикл
		Если СтрокаТаблицы.Валюта = ВалютаДоговора Тогда
			Продолжить;
		КонецЕсли;  
		
		КурсВалюты = кэшКурсов.Получить(СтрокаТаблицы.Валюта);
		
		Если КурсВалюты = Неопределено Тогда
			КурсВалюты = CW_Финансы.ПолучитьКурсВалюты(СтрокаТаблицы.Валюта, ДатаСреза);
			кэшКурсов.Вставить(СтрокаТаблицы.Валюта, КурсВалюты); 
		КонецЕсли;
		
		СтрокаТаблицы.Цена = CW_Финансы.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Цена,
			СтрокаТаблицы.Валюта, ВалютаДоговора, КурсВалюты.Курс, КурсВалютыДоговра.Курс, КурсВалюты.Кратность, КурсВалютыДоговра.Кратность);     
		
		СтрокаТаблицы.ЦенаБезНДС = CW_Финансы.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.ЦенаБезНДС,
			СтрокаТаблицы.Валюта, ВалютаДоговора, КурсВалюты.Курс, КурсВалютыДоговра.Курс, КурсВалюты.Кратность, КурсВалютыДоговра.Кратность);     
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаУслуг, ?(Форма= Неопределено, "",Форма.УникальныйИдентификатор));
	
КонецФункции

&НаСервере
Функция ПолучитьУслугиДоговора(АдресУслугПоДоговору) Экспорт
	
	Если ЭтоАдресВременногоХранилища(АдресУслугПоДоговору) Тогда
		
		ТаблицаУслуг = ПолучитьИзВременногоХранилища(АдресУслугПоДоговору);
		Если ТипЗнч(ТаблицаУслуг) = Тип("ТаблицаЗначений") Тогда 
			времТаблица = ТаблицаУслуг.Скопировать();
			времТаблица.Свернуть("Номенклатура",);
			Возврат времТаблица.ВыгрузитьКолонку("Номенклатура");
		КонецЕсли;
		
	Конецесли;
	
	Возврат Новый Массив;
	
КонецФункции

&НаСервере
Процедура УстановитьСписокУслуг(СтруктураДанных) Экспорт
	
	Если СтруктураДанных.ЕстьОграниченияПоСпискуУслуг Тогда
		СтруктураДанных.ЭлементФормы.РежимВыбораИзСписка 	= Истина;
		СтруктураДанных.ЭлементФормы.ИсторияВыбораПриВводе	= ИсторияВыбораПриВводе.НеИспользовать;
		Если ЭтоАдресВременногоХранилища(СтруктураДанных.АдресУслугПоДоговору) Тогда
			СтруктураДанных.ЭлементФормы.СписокВыбора.ЗагрузитьЗначения(ПолучитьУслугиДоговора(СтруктураДанных.АдресУслугПоДоговору));
		КонецЕсли;
		
	Иначе
		СтруктураДанных.ЭлементФормы.РежимВыбораИзСписка   = Ложь;
		СтруктураДанных.ЭлементФормы.ИсторияВыбораПриВводе	= ИсторияВыбораПриВводе.Авто;
		СтруктураДанных.ЭлементФормы.СписокВыбора.Очистить();		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьУслугуДоговораПоПараметрам(СтруктураПараметров) Экспорт

	тУслугиПоДоговору = ПолучитьИзВременногоХранилища(СтруктураПараметров.АдресУслугПоДоговору);
	
	МассивГрузы = Новый Массив;
	МассивГрузы.Добавить(Справочники.CW_Грузы.ПустаяСсылка());
	Если СтруктураПараметров.УстанавливатьЦенуВЗависимостиОтГруза Тогда
		МассивГрузы.Добавить(СтруктураПараметров.Груз);
	КонецЕсли;
	
	МассивКлиенты = Новый Массив;
	МассивКлиенты.Добавить(Справочники.Контрагенты.ПустаяСсылка());
	Если  СтруктураПараметров.УстанавливатьЦенуВЗависимостиОтКлиента Тогда
		МассивКлиенты.Добавить(СтруктураПараметров.Клиент);
	КонецЕсли;
	
	Запрос= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	запрос.Текст = "ВЫБРАТЬ
	               |	ВнешняяТаблицаУслуг.Номенклатура КАК Номенклатура,
	               |	ВнешняяТаблицаУслуг.Груз КАК Груз,
	               |	ВнешняяТаблицаУслуг.Клиент КАК Клиент,
	               |	ВнешняяТаблицаУслуг.ПорядокОтражения КАК ПорядокОтражения,
	               |	ВнешняяТаблицаУслуг.Цена КАК Цена,
	               |	ВнешняяТаблицаУслуг.СтавкаНДС КАК СтавкаНДС,
	               |	ВнешняяТаблицаУслуг.ВариантРасчетаНДС КАК ВариантРасчетаНДС,
	               |	ВнешняяТаблицаУслуг.ЦенаБезНДС КАК ЦенаБезНДС
	               |ПОМЕСТИТЬ ВТ_ТаблицаУслуг
	               |ИЗ
	               |	&ВнешняяТаблицаУслуг КАК ВнешняяТаблицаУслуг
	               |ГДЕ
	               |	ВнешняяТаблицаУслуг.Номенклатура = &Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТаблицаУслуг.Номенклатура КАК Номенклатура,
	               |	ВТ_ТаблицаУслуг.Груз КАК Груз,
	               |	ВТ_ТаблицаУслуг.Клиент КАК Клиент,
	               |	ВТ_ТаблицаУслуг.ПорядокОтражения КАК ПорядокОтражения,
	               |	ВТ_ТаблицаУслуг.Цена КАК Цена,
	               |	ВТ_ТаблицаУслуг.СтавкаНДС КАК СтавкаНДС,
	               |	ВТ_ТаблицаУслуг.ВариантРасчетаНДС КАК ВариантРасчетаНДС,
	               |	ВТ_ТаблицаУслуг.ЦенаБезНДС КАК ЦенаБезНДС
	               |ИЗ
	               |	ВТ_ТаблицаУслуг КАК ВТ_ТаблицаУслуг
	               |ГДЕ
	               |	ВТ_ТаблицаУслуг.Груз В(&МассивГрузов)
	               |	И ВТ_ТаблицаУслуг.Клиент В(&МассивКлиентов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Клиент УБЫВ,
	               |	Груз УБЫВ";
	
	Запрос.УстановитьПараметр("ВнешняяТаблицаУслуг"	, тУслугиПоДоговору);
	Запрос.УстановитьПараметр("Номенклатура"		, СтруктураПараметров.Номенклатура);
	Запрос.УстановитьПараметр("МассивГрузов"		, МассивГрузы);
	Запрос.УстановитьПараметр("МассивКлиентов"		, МассивКлиенты);
	
	РезультатЗапроса = запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции


//Обновление количества
&НаСервере
Процедура ОбработатьтаблицуУслугНаСервере(ВремТаблицаУслуги, УстановитьНольЕслиНеЗадан) Экспорт
	
	Для Каждого СтрокаТекущая из ВремТаблицаУслуги Цикл
		
		СтароеЗначениеКоличества = СтрокаТекущая.Количество;
		
		ДанныеСтроки = Новый Структура;
		ДанныеСтроки.Вставить("Грузоперевозка"	, СтрокаТекущая.Грузоперевозка);
		ДанныеСтроки.Вставить("Номенклатура"	, СтрокаТекущая.Номенклатура);
		
		ЗначениеПараметра = ПолучитьЗначениеПараметра(ДанныеСтроки, УстановитьНольЕслиНеЗадан);
		
		Если ЗначениеПараметра <> Неопределено Тогда
			Если СтароеЗначениеКоличества <> ЗначениеПараметра Тогда
				СтрокаТекущая.Количество =  ЗначениеПараметра;
				ПересчитатьДанныеСтроки(СтрокаТекущая);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьДанныеСтроки(СтрокаТекущая)
	
	СтрокаТекущая.Сумма = СтрокаТекущая.Цена * СтрокаТекущая.Количество;
	СтрокаТекущая.НДС 	= СтрокаТекущая.Сумма * CW_Финансы.ПолучитьСтавкуНДС(СтрокаТекущая.СтавкаНДС)/100;
	СтрокаТекущая.Всего = СтрокаТекущая.Сумма + СтрокаТекущая.НДС;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьЗначениеПараметра(ДанныеСтроки, УстановитьНольЕслиНеЗадан)
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("ТипПеревозки"		, ДанныеСтроки.Грузоперевозка.ТипПеревозки);
	СтруктураПараметров.Вставить("Номенклатура"		, ДанныеСтроки.Номенклатура);
	СтруктураПараметров.Вставить("ЕдиницаИзмерения"	, ДанныеСтроки.Номенклатура.ЕдиницаИзмерения);
	
	НайденныйПараметр 	= CW_Документы.ПолучитьПараметрДляПодстановкиЗначенияВКоличество(СтруктураПараметров);
	
	ЗначениеПараметра = Неопределено;
	
	Если НайденныйПараметр <> Неопределено Тогда
		
		//Получаем только первое значение
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_ХарактеристикиГрузоперевозок.Грузоперевозка КАК Грузоперевозка,
		               |	CW_ХарактеристикиГрузоперевозок.Параметр КАК Параметр,
		               |	CW_ХарактеристикиГрузоперевозок.Значение КАК Значение
		               |ИЗ
		               |	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
		               |ГДЕ
		               |	CW_ХарактеристикиГрузоперевозок.Грузоперевозка = &Грузоперевозка
		               |	И CW_ХарактеристикиГрузоперевозок.Параметр = &Параметр";  
		
		Запрос.УстановитьПараметр("Грузоперевозка", ДанныеСтроки.Грузоперевозка);
		Запрос.УстановитьПараметр("Параметр", 		НайденныйПараметр);
		
		РезультатаЗапроса = Запрос.Выполнить();
		Выборка = РезультатаЗапроса.Выбрать();
		Если Выборка.Следующий() тогда
			ЗначениеПараметра =  Выборка.Значение;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ЗначениеПараметра) Тогда
			ЗначениеПараметра = ?(УстановитьНольЕслиНеЗадан,0,1);
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат  ЗначениеПараметра;
	
КонецФункции

&НаСервере
Процедура ПриСозданииФормыСписка(ФормаОбъекта) Экспорт
	
	РедактированиеЗапрещено = Ложь;
	
	ТипОбъекта = _сф.стр_ПолучитьСтроку(ФормаОбъекта.ИмяФормы,".",1);
	ИмяОбъекта = _сф.стр_ПолучитьСтроку(ФормаОбъекта.ИмяФормы,".",2);
	
	РедактированиеЗапрещено = РегистрыСведений.CW_ДоступныеСправочникиПоГруппамПользователей.РедактированиеОбъектаЗапрещено(ТипОбъекта+"."+ИмяОбъекта);

	ФормаОбъекта.ТолькоПросмотр = РедактированиеЗапрещено;
	
	ЭлементФормы = ФормаОбъекта.Элементы.Найти("Список");
	Если ЭлементФормы <> Неопределено Тогда
		ЭлементФормы.ИзменятьСоставСтрок = НЕ РедактированиеЗапрещено;
		ЭлементФормы.ТолькоПросмотр		 = РедактированиеЗапрещено;
	КонецЕсли;
	
КонецПроцедуры

#Область ДополнительныеКолонкиДокументов

Процедура ОбновитьСписокДополнительныхКолонокФормы(ФормаОбъекта, ИмяНастройки) Экспорт
	
	ФормаОбъекта.СписокДополнительныхКолонок.Очистить();
	
	СоответствиеПараметров = Новый Соответствие;
	
	Справочники.CW_Грузоперевозки.ПолучитьСписокРеквизитовШапкиДляВыводаНаФорму(СоответствиеПараметров, ФормаОбъекта.СписокДополнительныхКолонок);
	ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ПолучиьСписокПараметровДляВыводаНаФорму(СоответствиеПараметров, ФормаОбъекта.СписокДополнительныхКолонок);
	
	ФормаОбъекта.СписокДоступныхПараметров.Добавить(СоответствиеПараметров);	
	
	//Настройки = Неопределено;
	Настройки = ХранилищеСистемныхНастроек.Загрузить(ФормаОбъекта.ИмяФормы, ИмяНастройки);
	Если Настройки <> Неопределено Тогда
		Если Настройки.Свойство("ВыбранныеКолонки") Тогда
			ФормаОбъекта.СписокВыбранныеКолонки.ЗагрузитьЗначения(Настройки.ВыбранныеКолонки);
			Для Каждого ЭлементМассива из Настройки.ВыбранныеКолонки Цикл
				ЭлементСписка = ФормаОбъекта.СписокДополнительныхКолонок.НайтиПоЗначению(ЭлементМассива);
				Если ЭлементСписка <> Неопределено Тогда
					ЭлементСписка.Пометка = истина;
				КонецЕсли;
			КонецЦикла;
			
			ДополнитьДинамическиеКолонки(ФормаОбъекта);
			
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДополнитьДинамическиеКолонки(ФормаОбъекта) Экспорт
	
    МассивДобавляемыхКолонокРезультатПоиска = Новый Массив;
	МассивУдаляемыхКолонокРезультатПоиска 	 = Новый Массив;
	
	мТипыРеквизитв = Новый Массив;
	мТипыРеквизитв.Добавить(Тип("Строка"));
	мТипыРеквизитв.Добавить(Тип("Число"));
	мТипыРеквизитв.Добавить(Тип("Дата"));
	мТипыРеквизитв.Добавить(Тип("Булево"));
	мТипыРеквизитв.Добавить(Справочники.ТипВсеСсылки());
	
	РеквизитыТаблицы = ФормаОбъекта.ПолучитьРеквизиты("Объект.Услуги");
	
	мРеквизитыТаблицы = Новый массив;
	Для Каждого Реквизит из РеквизитыТаблицы Цикл
		мРеквизитыТаблицы.Добавить(Реквизит.имя);
	КонецЦикла;

	СписокДобавляемыхДополнительныхКолонок = новый СписокЗначений;
	
	Для Каждого ЭлементСписка из ФормаОбъекта.СписокДополнительныхКолонок Цикл
		Если ЭлементСписка.Пометка тогда
			//РезультатПоиска
			Если мРеквизитыТаблицы.Найти("_"+ЭлементСписка.Значение) = Неопределено Тогда
				МассивДобавляемыхКолонокРезультатПоиска.Добавить(Новый РеквизитФормы("_"+ЭлементСписка.Значение, Новый ОписаниеТипов(мТипыРеквизитв), "Объект.Услуги",ЭлементСписка.Представление,Ложь));
			КонецЕсли;
			СписокДобавляемыхДополнительныхКолонок.Добавить(ЭлементСписка.Значение,ЭлементСписка.Представление,ЭлементСписка.Пометка); 
		Иначе
			УдаляемыйРеквизит = мРеквизитыТаблицы.Найти("_"+ЭлементСписка.Значение);
			Если УдаляемыйРеквизит <> Неопределено Тогда
				МассивУдаляемыхКолонокРезультатПоиска.Добавить("Объект.Услуги."+мРеквизитыТаблицы[УдаляемыйРеквизит]);
			КонецЕсли;
		КонецЕсли
	КонецЦикла;
	
	//РезультатПоиска
	ФормаОбъекта.ИзменитьРеквизиты(МассивДобавляемыхКолонокРезультатПоиска,МассивУдаляемыхКолонокРезультатПоиска);
	
	//Выводим на форме
	РасположениеКолонок = ФормаОбъекта.Элементы.Найти("УслугиДополнительныеКолонки");
	Если РасположениеКолонок = Неопределено тогда
		РасположениеКолонок = ФормаОбъекта.Элементы.Услуги;
	Конецесли;
	
	ВсегоКолонок = СписокДобавляемыхДополнительныхКолонок.Количество();
	Индекс = 0;
	
	СооветствиеГрупп = новый Соответствие;
	Для Индекс = 0 По  ВсегоКолонок Цикл
		Если Индекс%3 = 0 Тогда
			НайденныйЭлемент = ФормаОбъекта.Элементы.Найти("УслугиДополнительныеКолонки_"+Формат(Индекс,"ЧГ=0"));
			Если найденныйЭлемент <> Неопределено Тогда
				//Удаляем с формы
				ФормаОбъекта.Элементы.Удалить(НайденныйЭлемент);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Для Индекс = 0 По  ВсегоКолонок Цикл
		Если Индекс%3 = 0 Тогда
			НайденныйЭлемент = ФормаОбъекта.Элементы.Найти("УслугиДополнительныеКолонки_"+Формат(Индекс,"ЧГ=0"));
			Если найденныйЭлемент = Неопределено Тогда
				
				нЭлемент 				= ФормаОбъекта.Элементы.Добавить("УслугиДополнительныеКолонки_"+Формат(Индекс,"ЧГ=0"), Тип("ГруппаФормы"), РасположениеКолонок); 
				нЭлемент.Группировка 	= ГруппировкаКолонок.Вертикальная; 
				нЭлемент.ТолькоПросмотр = истина;
			КонецЕсли;
			
			СооветствиеГрупп.Вставить(Индекс, нЭлемент); 
		КонецЕсли;
	КонецЦикла;

	Для Каждого ЭлементСписка  из ФормаОбъекта.СписокДополнительныхКолонок Цикл
		//РезультатПоиска_
		НайденныйЭлемент = ФормаОбъекта.Элементы.Найти("Услуги_"+ЭлементСписка.Значение);
		Если найденныйЭлемент <> Неопределено Тогда
			//Удаляем с формы
			ФормаОбъекта.Элементы.Удалить(НайденныйЭлемент);
		КонецЕсли;
	КонецЦикла;
	
	Индекс = 0;
	Для Каждого ЭлементСписка  из СписокДобавляемыхДополнительныхКолонок Цикл
		
		Если Индекс%3 = 0 Тогда
			РасположениеКолонок = СооветствиеГрупп.Получить(Индекс);
		КонецЕсли;
		
		Если ФормаОбъекта.Элементы.Найти("Услуги_"+ЭлементСписка.Значение) = Неопределено  тогда
			//РезультатПоиска
			нЭлемент 				= ФормаОбъекта.Элементы.Добавить("Услуги_"+ЭлементСписка.Значение, Тип("ПолеФормы"), РасположениеКолонок); 
			нЭлемент.Вид 			= ВидПоляФормы.ПолеВвода; 
			нЭлемент.ПутьКДанным 	= "Объект.Услуги."+"_"+ЭлементСписка.Значение;
			нЭлемент.ТолькоПросмотр = истина;
		Конецесли;
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецПроцедуры

//В процедуры и функции передается структура следующего вида:
//	СтуктураПараметров = Новый Структура;
//	СтуктураПараметров.Вставить("Объект"				, );
//	СтуктураПараметров.Вставить("ТаблицаДокумента"		, );
//	СтуктураПараметров.Вставить("ВыбранныеКолонки"		, );
//	СтуктураПараметров.Вставить("СоответствиеПараметров", );
//	СтуктураПараметров.Вставить("мГрузоперевозки"		, );
//
Процедура ОбновитьЗначенияПараметровГрузоперевозок(СтруктураПараметров) Экспорт
	
	ВыборкаЗначенийДополнительныхКолонок = ПолучитьЗначенияДополнительныхКолонокТаблицы(СтруктураПараметров);
	
	Для Каждого СтрокаУслуг из СтруктураПараметров.ТаблицаДокумента Цикл
		Для Каждого ЭлементСписка из СтруктураПараметров.ВыбранныеКолонки Цикл
			
			СтрокаСоответствия = СтруктураПараметров.СоответствиеПараметров.Получить(ЭлементСписка);
			Если СтрокаСоответствия <> Неопределено Тогда
				
				Если СтрокаСоответствия.ЭтоПараметр Тогда
					ОтборВыборки = Новый Структура("Грузоперевозка,Параметр",СтрокаУслуг.Грузоперевозка, СтрокаСоответствия.Значение); 
				Иначе
					ОтборВыборки = Новый Структура("Грузоперевозка",СтрокаУслуг.Грузоперевозка); 
				КонецЕсли;
				
				Если  ВыборкаЗначенийДополнительныхКолонок <> Неопределено Тогда
					ВыборкаЗначенийДополнительныхКолонок.Сбросить();
					Если ВыборкаЗначенийДополнительныхКолонок.НайтиСледующий(ОтборВыборки) Тогда
						Если СтрокаСоответствия.ЭтоПараметр Тогда 
							Если СтрЗаканчиваетсяНа(ЭлементСписка, "План") Тогда
								СтрокаУслуг["_"+ЭлементСписка] = ВыборкаЗначенийДополнительныхКолонок.ЗначениеПлан;
							ИначеЕсли СтрЗаканчиваетсяНа(ЭлементСписка, "Факт") Тогда  
								СтрокаУслуг["_"+ЭлементСписка] = ВыборкаЗначенийДополнительныхКолонок.ЗначениеФакт;
							Иначе
								СтрокаУслуг["_"+ЭлементСписка] = ВыборкаЗначенийДополнительныхКолонок.Значение;
							КонецЕсли;
						Иначе
							СтрокаУслуг["_"+ЭлементСписка] = ВыборкаЗначенийДополнительныхКолонок[СтрокаСоответствия.Значение];
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;  
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЗначенияДополнительныхКолонокТаблицы(СтруктураПараметров)
	
	мПараметры = Новый Массив;
	мРеквизиты = Новый Массив;
	Для Каждого ЭлементМассива из СтруктураПараметров.ВыбранныеКолонки Цикл
		СтрокаСоответствия = СтруктураПараметров.СоответствиеПараметров.Получить(ЭлементМассива);
		Если СтрокаСоответствия <> Неопределено Тогда
			Если СтрокаСоответствия.ЭтоПараметр Тогда
				мПараметры.Добавить(СтрокаСоответствия.Значение);
			Иначе
				мРеквизиты.Добавить(СтрокаСоответствия.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//формируем масив заказов
	мЗаказы = Новый Массив;
	Для Каждого Грузоперевозка из СтруктураПараметров.мГрузоперевозки Цикл
		Если Не ЗначениеЗаполнено(Грузоперевозка.Заказ) Тогда
			Продолжить;
		КонецЕсли;
		Если мЗаказы.Найти(Грузоперевозка.Заказ) = Неопределено Тогда
			мЗаказы.Добавить(Грузоперевозка.Заказ);	
		КонецЕсли;
	КонецЦикла;
	//КОНЕЦ формируем масив заказов
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ";
	
	Для Каждого ЭлементМассива из мРеквизиты Цикл
		Запрос.Текст = Запрос.Текст + "			   
		|	CW_Грузоперевозки."+ЭлементМассива+" КАК "+ЭлементМассива+",";
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "			   
	|	CW_Грузоперевозки.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Грузоперевозки
	|ИЗ
	|	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	|ГДЕ
	|	CW_Грузоперевозки.Ссылка В(&мГрузоперевозки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CW_ХарактеристикиГрузоперевозок.Грузоперевозка КАК Грузоперевозка,
	|	CW_ХарактеристикиГрузоперевозок.Параметр КАК Параметр,
	|	CW_ХарактеристикиГрузоперевозок.Значение КАК Значение,
	|	CW_ХарактеристикиГрузоперевозок.ЗначениеПлан КАК ЗначениеПлан,
	|	CW_ХарактеристикиГрузоперевозок.ЗначениеФакт КАК ЗначениеФакт
	|ПОМЕСТИТЬ ВТ_ПараметрыГрузоперевозок
	|ИЗ
	|	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
	|ГДЕ
	|	CW_ХарактеристикиГрузоперевозок.Грузоперевозка В(&мГрузоперевозки)
	|	И CW_ХарактеристикиГрузоперевозок.Параметр В(&мПараметры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
  	|ВЫБРАТЬ
	|	CW_ХарактеристикиЗаказов.Заказ КАК Заказ,
	|	CW_ХарактеристикиЗаказов.Параметр КАК Параметр,
	|	CW_ХарактеристикиЗаказов.Значение КАК Значение,
	|	CW_ХарактеристикиЗаказов.ЗначениеПлан КАК ЗначениеПлан,
	|	CW_ХарактеристикиЗаказов.ЗначениеФакт КАК ЗначениеФакт
	|ПОМЕСТИТЬ ВТ_ПараметрыЗаказов
	|ИЗ
	|	РегистрСведений.CW_ХарактеристикиЗаказов КАК CW_ХарактеристикиЗаказов
	|ГДЕ
	|	&ЕстьЗаказы
	|	И CW_ХарактеристикиЗаказов.Заказ В(&мЗаказы)
	|	И CW_ХарактеристикиЗаказов.Параметр В(&мПараметры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Грузоперевозки.Ссылка КАК Грузоперевозка,";
	
	Для Каждого ЭлементМассива из мРеквизиты Цикл
		Запрос.Текст = Запрос.Текст + "			   
		|	ВТ_Грузоперевозки."+ЭлементМассива+" КАК "+ЭлементМассива+",";
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "			   
	|	ЕСТЬNULL(ВТ_ПараметрыГрузоперевозок.Параметр, ЕСТЬNULL(ВТ_ПараметрыЗаказов.Параметр, НЕОПРЕДЕЛЕНО)) КАК Параметр,
	|	ЕСТЬNULL(ВТ_ПараметрыГрузоперевозок.Значение, ЕСТЬNULL(ВТ_ПараметрыЗаказов.Значение, НЕОПРЕДЕЛЕНО)) КАК Значение,
	|	ЕСТЬNULL(ВТ_ПараметрыГрузоперевозок.ЗначениеПлан, ЕСТЬNULL(ВТ_ПараметрыЗаказов.ЗначениеПлан, НЕОПРЕДЕЛЕНО)) КАК ЗначениеПлан,
	|	ЕСТЬNULL(ВТ_ПараметрыГрузоперевозок.ЗначениеФакт, ЕСТЬNULL(ВТ_ПараметрыЗаказов.ЗначениеФакт, НЕОПРЕДЕЛЕНО)) КАК ЗначениеФакт
	|ИЗ
	|	ВТ_Грузоперевозки КАК ВТ_Грузоперевозки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыГрузоперевозок КАК ВТ_ПараметрыГрузоперевозок
	|		ПО ВТ_Грузоперевозки.Ссылка = ВТ_ПараметрыГрузоперевозок.Грузоперевозка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыЗаказов КАК ВТ_ПараметрыЗаказов
	|		ПО ВТ_Грузоперевозки.Ссылка.Заказ = ВТ_ПараметрыЗаказов.Заказ";
	
	Запрос.УстановитьПараметр("мГрузоперевозки",	СтруктураПараметров.мГрузоперевозки);
	Запрос.УстановитьПараметр("мЗаказы"	, 			мЗаказы);
	Запрос.УстановитьПараметр("мПараметры", 		мПараметры);
	Запрос.УстановитьПараметр("ЕстьЗаказы", 		мЗаказы.Количество() > 0);
	
	Возврат Запрос.Выполнить().Выбрать(); 
	
КонецФункции

Процедура ОбновитьЗначенияПараметровГрузоперевозкиПоСтроке(СтрокаТабличнойЧасти, СтруктураПараметров) Экспорт
	
	Если СтруктураПараметров.ВыбранныеКолонки.Количество() > 0 Тогда
		
		мГрузопереовзки = Новый Массив;
		мГрузопереовзки.Добавить(СтрокаТабличнойЧасти.Грузоперевозка);
		
		ВыборкаЗначенийДополнительныхКолонок = ПолучитьЗначенияДополнительныхКолонокТаблицы(СтруктураПараметров);
		
		Если  ВыборкаЗначенийДополнительныхКолонок <> Неопределено Тогда
			
			Для Каждого идКолонки из СтруктураПараметров.ВыбранныеКолонки Цикл
				
				СтрокаСоответствия = СтруктураПараметров.СоответствиеПараметров.Получить(идКолонки);
				
				Если СтрокаСоответствия.ЭтоПараметр Тогда
					ОтборВыборки = Новый Структура("Грузоперевозка,Параметр",СтрокаТабличнойЧасти.Грузоперевозка, СтрокаСоответствия.Значение); 
				Иначе
					ОтборВыборки = Новый Структура("Грузоперевозка",СтрокаТабличнойЧасти.Грузоперевозка); 
				КонецЕсли;

				ВыборкаЗначенийДополнительныхКолонок.Сбросить();
				Если ВыборкаЗначенийДополнительныхКолонок.НайтиСледующий(ОтборВыборки) Тогда
					
					Если СтрокаСоответствия.ЭтоПараметр Тогда
						СтрокаТабличнойЧасти["_"+идКолонки] = ВыборкаЗначенийДополнительныхКолонок.Значение;
					Иначе
						СтрокаТабличнойЧасти["_"+идКолонки] = ВыборкаЗначенийДополнительныхКолонок[СтрокаСоответствия.Значение];
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;  
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область Подписанты_для_Документов

Функция ПолучитьОтветственныхЛиц(тОрганизация, ПодразделениеОрганизации) Экспорт
	
	//Для версии КОРП
	ВестиУчетПоПодразделениям	= ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	//Для версии КОРП
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
					|	УполномоченныеЛицаОрганизаций.ЗаКогоПодписывает КАК ЗаКогоПодписывает,
					|	УполномоченныеЛицаОрганизаций.УполномоченноеЛицо КАК УполномоченноеЛицо,
					|	УполномоченныеЛицаОрганизаций.ОснованиеПраваПодписи.Представление КАК НомерДатаПриказа
					|ИЗ
					|	РегистрСведений.УполномоченныеЛицаОрганизаций КАК УполномоченныеЛицаОрганизаций
					|ГДЕ
					|	УполномоченныеЛицаОрганизаций.Организация = &Организация
					|	И УполномоченныеЛицаОрганизаций.Пользователь = &Пользователь
					//Для версии КОРП
					|	И ВЫБОР
					|			КОГДА &ВестиУчетПоПодразделениям
					|				ТОГДА УполномоченныеЛицаОрганизаций.ПодразделениеОрганизации = &ПодразделениеОрганизации
					|			ИНАЧЕ ИСТИНА
					|		КОНЕЦ";
					//Для версии КОРП
	
	Запрос.УстановитьПараметр("Организация"		, тОрганизация);
	Запрос.УстановитьПараметр("Пользователь"	, CW_Настройки.Пользователь()); 
	
	//Для версии КОРП
	Запрос.УстановитьПараметр("ВестиУчетПоПодразделениям"		, ВестиУчетПоПодразделениям);
	Запрос.УстановитьПараметр("ПодразделениеОрганизации"		, ПодразделениеОрганизации);
	//Для версии КОРП
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СоответствиеУполномоченныеЛицаОрганизаций = новый Соответствие;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеПодписанта = Новый Структура("УполномоченноеЛицо,НомерДатаПриказа");
		ЗаполнитьЗначенияСвойств(ДанныеПодписанта, Выборка);
		
		СоответствиеУполномоченныеЛицаОрганизаций.Вставить(Выборка.ЗаКогоПодписывает,ДанныеПодписанта);
	
	КонецЦикла;

	Возврат СоответствиеУполномоченныеЛицаОрганизаций;
	
КонецФункции

#КонецОбласти

#Область Перенаправление_на_другую_форму

Процедура CW_ОбработкаПолученияФормыОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	ИспользованиеВнешнихПодключаемыхФормОбъектов = ПолучитьФункциональнуюОпцию("CW_ИспользованиеВнешнихПодключаемыхФормОбъектов");
	
	Если ИспользованиеВнешнихПодключаемыхФормОбъектов Тогда
		
		ПараметрыПолученияФормы = Новый Структура("Источник,ВидФормы", Источник, ВидФормы);
		НоваяВыбраннаяФорма 	= _ПО.ПолучитьИмяВыбраннойФормы(ПараметрыПолученияФормы);
		
		Если НоваяВыбраннаяФорма <> Неопределено Тогда
			СтандартнаяОбработка 	= Ложь;
			ВыбраннаяФорма 			= НоваяВыбраннаяФорма;
		КонецЕсли;
			
	Конецесли;
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьПредопределенныеЗначенияРеквизитовШапки(Объект, ТипПеревозки, Назначение = "ДляГрузоперевозки") Экспорт
	
	ПредопределенныеЗначенияРеквизитов = Справочники.CW_ТипыПеревозок.ПолучитьЗначенияПредопределенныхЗначенийРеквизитовШапки(ТипПеревозки, Назначение);
	Для Каждого ЭлементСтруктуры из ПредопределенныеЗначенияРеквизитов Цикл
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, ЭлементСтруктуры.Ключ) Тогда
			
			ЗначениеРеквизита = ЭлементСтруктуры.Значение;
			Если ЗначениеЗаполнено(Объект[ЭлементСтруктуры.Ключ]) Тогда
				Если ЗначениеРеквизита.ПерезаполнятьЗначение Тогда
					Объект[ЭлементСтруктуры.Ключ] = ЗначениеРеквизита.Значение;
				КонецЕсли;
			Иначе
				Объект[ЭлементСтруктуры.Ключ] = ЗначениеРеквизита.Значение;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


//Наличие прикрепленных файлов
Функция ЗапрашиватьТипФайлаПриДобавленииВАрхив() Экспорт
	
	Возврат Константы.CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив.Получить();
	
КонецФункции

Функция ПолучитьАдресКартинкиФайлов(ОбъектАрхива, УникальныйИдентификатор) Экспорт
	
	ЕстьФайлы 	= Справочники.CW_ОбъектыАрхива.ЕстьПрикрикрепленныеФайлыОбъекта(ОбъектАрхива);
	
	Возврат ПоместитьВоВременноеХранилище(?(ЕстьФайлы,БиблиотекаКартинок.CW_Архив, БиблиотекаКартинок.CW_СерыйПлюс), УникальныйИдентификатор);
	
КонецФункции

Функция ПрикрепитьФайлы(ОбъектАрхива, МассивФайлов, ТипДокумента=Неопределено, Комментарий = Неопределено) Экспорт
	
	ЗначениеВозврата = Истина;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ТомаАрхива.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ТомаАрхива КАК ТомаАрхива
	               |ГДЕ
	               |	ТомаАрхива.Основной = ИСТИНА";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТомАрхива = Выборка.Ссылка;
	Иначе
		ТомАрхива = ПредопределенноеЗначение("Справочник.CW_ТомаАрхива.ПустаяСсылка");
	КонецЕсли; 
	
	Для каждого СтруктураФайла Из МассивФайлов Цикл
		
		Попытка
			
			НачатьТранзакцию();
			
			ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(СтруктураФайла.Хранение);
			РазмерБайт 			= ДвоичныеДанныеФайла.Размер();
			
			// создаем объект архива
			СпрОбъектыАрхива = Справочники.CW_ОбъектыАрхива.СоздатьЭлемент();
			// --- 
			СпрОбъектыАрхива.Владелец 		= ОбъектАрхива;
			СпрОбъектыАрхива.Объект 		= ОбъектАрхива;
			СпрОбъектыАрхива.ИмяФайла 		= СтруктураФайла.Имя;
			СпрОбъектыАрхива.Расширение 	= _сф.ф_РасширениеФайла(СпрОбъектыАрхива.ИмяФайла);
			СпрОбъектыАрхива.Размер 		= РазмерБайт;
			СпрОбъектыАрхива.Наименование 	= СпрОбъектыАрхива.ИмяФайла;
			СпрОбъектыАрхива.Том 			= ТомАрхива;
			СпрОбъектыАрхива.ТипДокумента	= ТипДокумента;  
			СпрОбъектыАрхива.Комментарий	= Комментарий;
			СпрОбъектыАрхива.Записать();
			// --- 
			Ответ = _ФА.ЗагрузитьФайлАрхива(СпрОбъектыАрхива.Ссылка,СтруктураФайла.Хранение);
			Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
				СпрОбъектыАрхива.ФайлЗагружен = Истина;
				СпрОбъектыАрхива.Записать();
			Иначе
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = _УФКС.ПредставлениеОшибки(Ответ);
				Сообщение.Сообщить();
				
				ВызватьИсключение "Ошибка прикрепления файла";
				
			КонецЕсли; 
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки();
			Сообщение.Сообщить();
			
			Если (ТранзакцияАктивна()) Тогда
				ОтменитьТранзакцию();
			КонецЕсли; 
			
			ЗначениеВозврата = Ложь;
			
		КонецПопытки; 
		
	КонецЦикла; 
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ЗначениеВозврата;
	
КонецФункции
//Наличие прикрепленных файлов
